# THIS FILE IS AUTOMATICALLY GENERATED
# Project: C:\Users\Graziano G. Ravizza\Documents\PSoC Creator\SQUIT\Vers.0.0-T00 2019-0208 C3.0 (start)\Squit-Proto.cydsn\Squit-Proto.cyprj
# Date: Fri, 08 Feb 2019 11:26:50 GMT
#set_units -time ns
create_clock -name {ADC_Ext_CP_Clk(routed)} -period 15.151515151515152 -waveform {0 7.57575757575758} [list [get_pins {ClockBlock/dclk_0}]]
create_clock -name {WaveDAC8_DacClk(routed)} -period 100000 -waveform {0 50000} [list [get_pins {ClockBlock/dclk_3}]]
create_clock -name {Clock_CTRL(routed)} -period 666666.66666666663 -waveform {0 333333.333333333} [list [get_pins {ClockBlock/aclk_1}]]
create_clock -name {Clock_SYS(routed)} -period 10000000 -waveform {0 5000000} [list [get_pins {ClockBlock/dclk_4}]]
create_clock -name {CyIMO} -period 333.33333333333331 -waveform {0 166.666666666667} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CyPLL_OUT} -period 15.151515151515152 -waveform {0 7.57575757575758} [list [get_pins {ClockBlock/pllout}]]
create_clock -name {CyILO} -period 1000000 -waveform {0 500000} [list [get_pins {ClockBlock/ilo}] [get_pins {ClockBlock/clk_100k}] [get_pins {ClockBlock/clk_1k}] [get_pins {ClockBlock/clk_32k}]]
create_clock -name {CyXTAL} -period 125 -waveform {0 62.5} [list [get_pins {ClockBlock/xtal}]]
create_clock -name {CyMASTER_CLK} -period 15.151515151515152 -waveform {0 7.57575757575758} [list [get_pins {ClockBlock/clk_sync}]]
create_clock -name {ADC_Ext_CP_Clk} -period 15.151515151515152 -waveform {0 7.57575757575758} [list [get_pins {ClockBlock/dclk_glb_0}]]
create_generated_clock -name {Clock_2} -source [get_pins {ClockBlock/clk_sync}] -edges {1 3 7} -nominal_period 45.454545454545453 [list [get_pins {ClockBlock/dclk_glb_1}]]
create_generated_clock -name {ADC_theACLK} -source [get_pins {ClockBlock/clk_sync}] -edges {1 19 37} [list [get_pins {ClockBlock/aclk_glb_0}]]
create_clock -name {ADC_theACLK(fixed-function)} -period 272.72727272727275 -waveform {0 136.363636363636} [get_pins {ClockBlock/aclk_glb_ff_0}]
create_generated_clock -name {UART_USB_IntClock} -source [get_pins {ClockBlock/clk_sync}] -edges {1 143 287} [list [get_pins {ClockBlock/dclk_glb_2}]]
create_generated_clock -name {WaveDAC8_DacClk} -source [get_pins {ClockBlock/clk_sync}] -edges {1 6601 13201} -nominal_period 100000 [list [get_pins {ClockBlock/dclk_glb_3}]]
create_generated_clock -name {Clock_CTRL} -source [get_pins {ClockBlock/clk_sync}] -edges {1 44001 88001} -nominal_period 666666.66666666663 [list [get_pins {ClockBlock/aclk_glb_1}]]
create_generated_clock -name {Clock_SYS} -source [get_pins {ClockBlock/clk_sync}] -edges {1 660001 1320001} -nominal_period 10000000 [list [get_pins {ClockBlock/dclk_glb_4}]]
create_clock -name {Clock_SYS(fixed-function)} -period 10000000 -waveform {0 15.1515151515152} -nominal_period 10000000 [get_pins {ClockBlock/dclk_glb_ff_4}]
create_generated_clock -name {CyBUS_CLK} -source [get_pins {ClockBlock/clk_sync}] -edges {1 2 3} [list [get_pins {ClockBlock/clk_bus_glb}]]
create_clock -name {CyBUS_CLK(fixed-function)} -period 15.151515151515152 -waveform {0 7.57575757575758} [get_pins {ClockBlock/clk_bus_glb_ff}]

set_false_path -from [get_pins {__ONE__/q}]
set_false_path -from [get_pins {__ZERO__/q}]

# Component constraints for C:\Users\Graziano G. Ravizza\Documents\PSoC Creator\SQUIT\Vers.0.0-T00 2019-0208 C3.0 (start)\Squit-Proto.cydsn\TopDesign\TopDesign.cysch
# Project: C:\Users\Graziano G. Ravizza\Documents\PSoC Creator\SQUIT\Vers.0.0-T00 2019-0208 C3.0 (start)\Squit-Proto.cydsn\Squit-Proto.cyprj
# Date: Fri, 08 Feb 2019 11:26:32 GMT
